KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fd2d4467-c99a-4ae0-9d0c-18b83c88da0a">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f53c0f1-28e1-4b6c-bf6d-4ee84e53f2e7">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86ff623a-1439-42bc-865c-6d1a6f2310ef">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="580adfdd-4e0f-429d-a6b6-26bbd1c484ae">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f24e8e16-21ad-4eeb-a73d-06152c4d9a1e">
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3299776f-a304-476e-a0d9-a9132b128869">
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0789d7c2-8020-4d52-a305-445f9faa9b76">
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="10db127e-a377-4878-8ead-955d0ff48e4d">
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5cb9669e-543b-4d33-b9a2-c6dc788de898">
    <name>ПоставкаПодПринципала</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f53b3b31-9cd3-4a9b-b293-626b3a525d66">
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="889e8977-08be-4aa4-b9d7-0df860d997ab">
    <name>ПередачаМатериаловВПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/Forms/ФормаДокумента/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСписокОпераций")
Процедура КАНАТ_ЗаполнитьСписокОпераций()

	ОперацииВПорядкеДобавления = Новый Массив();
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой);
	#Удаление
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство);
	#КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24++
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство);
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_06.03.24--
	#КонецВставки
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов);
	ОперацииВПорядкеДобавления.Добавить(Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатовМеждуФилиалами);

	ДоступныеОперации = Документы.ДвижениеПродукцииИМатериалов.СписокОпераций();

	Элементы.ХозяйственнаяОперация.СписокВыбора.Очистить();
	Для каждого ЭлементКоллекции Из ОперацииВПорядкеДобавления Цикл

		ДоступнаяОперация = ДоступныеОперации.НайтиПоЗначению(ЭлементКоллекции);
		Если ДоступнаяОперация <> Неопределено Тогда
			Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(ДоступнаяОперация.Значение, ДоступнаяОперация.Представление);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодборСерий")
Процедура КАНАТ_ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)

	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные)Тогда

		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение", 
														ЭтотОбъект, 
														Новый Структура("ПараметрыФормыУказанияСерий", ПараметрыФормыУказанияСерий));
		#Вставка
		//ПараметрыФормыУказанияСерий.ИмяФормы = "Обработка.ПодборСерийВДокументы.Форма.КАНАТ_РегистрацияИПодборСерийПоОднойСтрокеТоваров_РасходныйОрдер";
		//	ПараметрыФормыУказанияСерий.ТолькоПросмотр = Истина;
		//ПараметрыФормыУказанияСерий.Вставить("КоличествоКОтгрузке",ТекущиеДанные.КоличествоУпаковок);
		#КонецВставки
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
						ПараметрыФормыУказанияСерий,ЭтаФорма,,,, 
						ОписаниеОповещения,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработатьУказаниеСерийСервер")
Процедура КАНАТ_ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий)

	НоменклатураСервер.ОбработатьУказаниеСерий(Объект,ПараметрыУказанияСерий,ПараметрыФормыУказанияСерий);
    #Вставка  
	// 
	//Объект.Товары[0].Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда
		НайденныеТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Серия",ПараметрыФормыУказанияСерий.Номенклатура,ПараметрыФормыУказанияСерий.Характеристика,Справочники.СерииНоменклатуры.ПустаяСсылка()));
		//НайденныеСерии = Объект.Серии.НайтиСтроки(Новый Структура("Номенклатура,Характеристика,Серия",ПараметрыФормыУказанияСерий.Номенклатура,ПараметрыФормыУказанияСерий.Характеристика,Справочники.СерииНоменклатуры.ПустаяСсылка()));
		Если НайденныеТовары.Количество() = 1 ТОгда 
			ТЗ = ПолучитьИзВременногоХранилища(ПараметрыФормыУказанияСерий.АдресВоВременномХранилище); 
			НайденныеТовары[0].Серия = ТЗ[0].Серия; 
			Объект.ВидыЗапасов[0].Серия = ТЗ[0].Серия; 
			//НайденныеСерии[0].Серия = ТЗ[0].Серия; 
			//НовСтрСерия = Объект.Серии.Добавить();
			//НовСтрСерия.Номенклатура = ПараметрыФормыУказанияСерий.Номенклатура; 
			//НовСтрСерия.Характеристика = ПараметрыФормыУказанияСерий.характеристика;
			//НовСтрСерия.Серия = ТЗ[0].Серия;
			//НовСтрСерия.Количество = ТЗ[0].Количество;
			//
			//Найденные[0].Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			НайденныеТовары[0].Количество = ТЗ[0].Количество;
			НайденныеТовары[0].КоличествоУпаковок = ТЗ[0].КоличествоУпаковок; 
			//НайденныеСерии[0].КоличествоУпаковок = ТЗ[0].КоличествоУпаковок;
		КонецЕсли;
		
	КонецЕсли; 
	//ЭтаФорма.Прочитать();
	#КонецВставки
КонецПроцедуры

&НаСервере
Функция КАНАТ_ПолучитьКоличествоКОтгрузке(Ссылка, Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|	И ДвижениеПродукцииИМатериаловТовары.Номенклатура = &Номенклатура
		|	И ДвижениеПродукцииИМатериаловТовары.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.КоличествоУпаковок;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
